app/controllers/api/artists_controller.rb

SELECT "songs"."id" FROM "songs" INNER JOIN "albums" ON "songs"."album_id" = "albums"."id" WHERE "albums"."artist_id" = $1  [["artist_id", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show

        @artist = Artist.includes(:albums, :songs).with_attached_artist_img.find(params[:id])