app/controllers/api/playlists_controller.rb

INSERT INTO "playlists" ("title", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Playlist-1"], ["author_id", 17], ["created_at", "2019-06-01 23:47:19.254241"], ["updated_at", "2019-06-01 23:47:19.254241"]]
---
    def create
        @playlist = Playlist.new(playlist_params)
        if @playlist.save

SELECT  "playlists".* FROM "playlists" WHERE "playlists"."author_id" = $1 LIMIT $2  [["author_id", 17], ["LIMIT", 1]]
---
    def index
        author_id = params[:author_id]
        @playlists = Playlist.where(author_id: author_id)

SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def show
        id = params[:id].to_i
        @playlist = Playlist.find(id)