app/controllers/api/users_controller.rb

    def create

    errors = []
    if params[:user][:username] == ""
      errors << "username"
---
INSERT INTO "users" ("email", "username", "password_digest", "session_token", "birth_month", "birth_day", "birth_year", "gender", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"


    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("email", "username", "password_digest", "session_token", "birth_month", "birth_day", "birth_year", "gender", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"