app/views/api/artists/show.json.jbuilder

json.songs do
    @artist.songs.each do |song|
---
SELECT "songs".* FROM "songs" INNER JOIN "albums" ON "songs"."album_id" = "albums"."id" WHERE "albums"."artist_id" = $1  [["artist_id", 1]]