app/models/user.rb

    def self.find_by_credentials(info,  password)
        user =  User.find_by(email: info) ? User.find_by(email: info) : User.find_by(username: info)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "jt1"], ["LIMIT", 1]]

    def reset_session_token!
        self.session_token = SecureRandom.urlsafe_base64
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "TAOdSepnIqTgEk80CgUuog"], ["updated_at", "2019-06-02 16:01:07.745161"], ["id", 17]]